Repository: Asmaa-Elhendy/nartawiAzure
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: NARTAWI
ar: نرتوي

source: Settings
ar: الإعدادات

source: Profile
ar: الملف الشخصي

source: My Impact
ar: تأثيري

source: My e-Wallet
ar: محفظتي الإلكترونية

source: Delivery Addresses
ar: عناوين التوصيل

source: Scan QR
ar: مسح QR

source: Order Details
ar: تفاصيل الطلب

source: Home
ar: الرئيسية

source: Orders
ar: الطلبات

source: Coupons
ar: الكوبونات

source: Favorites
ar: المفضلة

source: Notifications
ar: الإشعارات

source: Let's Get Started
ar: لنبدأ

# onboarding1
source: Pick Your Favorite Water Brand, Coupon Bundle, And Delivery Address
ar: اختر علامتك المائية المفضلة، حزمة الكوبونات، وعنوان التوصيل

# onboarding2
source: Confirm Your Order And Checkout—All in Few Taps
ar: أكد طلبك وقم بالدفع - كل ذلك بنقرات قليلة

# onboarding3
source: Stay refreshed. Your water arrives straight to your door every week. Say goodbye to paper coupons
ar: ابقَ منعشاً. مياهك تصل مباشرة إلى بابك كل أسبوع. قل وداعاً لكوبونات الورق

source: Enter Email
ar: أدخل البريد الإلكتروني

source: Enter Password
ar: أدخل كلمة المرور

source: Password
ar: كلمة المرور

source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Forgot Password
ar: نسيت كلمة المرور

source: Remember Me
ar: تذكرني

source: Username
ar: اسم المستخدم

source: First Name
ar: الاسم الأول

source: Last Name
ar: الاسم الأخير

source: Email Address
ar: البريد الإلكتروني

source: Phone
ar: الهاتف

source: Alternative Phone Number
ar: رقم الهاتف البديل

source: Confirm Password
ar: تأكيد كلمة المرور

source: Enter Username
ar: أدخل اسم المستخدم

source: Enter First Name
ar: أدخل الاسم الأول

source: Enter Last Name
ar: أدخل الاسم الأخير

# exEmail
source: Ex: abc@example.com
ar: مثال: abc@example.com

# enterPhone
source: Enter Phone Number
ar: أدخل رقم الهاتف

# enterAlternativePhone
source: Enter Alternative phone number
ar: أدخل رقم الهاتف البديل

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# loginButton
source: Login
ar: تسجيل الدخول

# emailRequired
source: Email Address is required
ar: البريد الإلكتروني مطلوب

# enterValidEmail
source: Enter a valid email
ar: أدخل بريد إلكتروني صحيح

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# confirmPasswordRequired
source: Confirm Password is required
ar: تأكيد كلمة المرور مطلوب

# passwordMismatch
source: Password doesn't match
ar: كلمات المرور غير متطابقة

# fieldRequired
source: is required
ar: مطلوب

source: Pick From Gallery
ar: اختر من المعرض

source: Pick From Camera
ar: التقط صورة

source: Male
ar: ذكر

source: Female
ar: أنثى

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Language Preference
ar: تفضيل اللغة

# receiveOffers
source: Yes, I want to receive offers and discounts
ar: نعم، أريد استلام العروض والخصومات

# subscribeNewsletter
source: Subscribe To Newsletter
ar: الاشتراك في النشرة البريدية

source: Change Password
ar: تغيير كلمة المرور

source: Log Out
ar: تسجيل الخروج

# areYouSureLogout
source: Are you sure you want to log out?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Cancel
ar: إلغاء

# remove
source: Delete
ar: حذف

# addedToCart
source: You've added {quantity} item
ar: لقد أضفت عنصراً واحداً

# selectedItemNotConfirmed
source: You selected 1 item, but you haven't confirmed your choice yet
ar: لقد اخترت عنصراً واحداً، لكنك لم تؤكد اختيارك بعد

source: Add To Cart
ar: أضف إلى السلة

source: Continue Shopping
ar: متابعة التسوق

source: Confirm
ar: تأكيد

# supplierError
source: All order products must be from the same supplier
ar: يجب أن تكون جميع منتجات الطلب من نفس المورد

# maxCouponsReached
source: You already have 2 coupons. Continue to buy another one?
ar: لديك بالفعل 2 كوبونات. هل تريد شراء آخر؟

source: View Store
ar: عرض المتجر

# removeAllItems
source: Remove all items from your cart?
ar: إزالة جميع العناصر من سلتك؟

source: Order
ar: طلب

source: Cancel Order
ar: إلغاء الطلب

# cancelOrderConfirm
source: Are you sure you want to cancel this order?
ar: هل أنت متأكد من إلغاء هذا الطلب؟

# paymentRefunded
source: Your payment will be refunded to your wallet.
ar: سيتم استرداد دفعتك إلى محفظتك.

source: No, Keep Order
ar: لا، الاحتفاظ بالطلب

source: Yes, Cancel
ar: نعم، إلغاء

source: Start Delivery
ar: بدء التوصيل

# startDeliveryConfirm
source: Are you ready to start delivery for order #
ar: هل أنت مستعد لبدء توصيل الطلب #

# orderCanceled
source: Order canceled successfully
ar: تم إلغاء الطلب بنجاح

# deliveryStarted
source: Delivery started successfully
ar: بدء التوصيل بنجاح

# failedCancelOrder
source: Failed to cancel order
ar: فشل في إلغاء الطلب

# failedStartDelivery
source: Failed to start delivery
ar: فشل في بدء التوصيل

source: Leave Review
ar: مغادرة المراجعة

source: Retry
ar: إعادة المحاولة

source: No orders found
ar: لا توجد طلبات

source: My Orders
ar: طلباتي

source: Unknown
ar: غير معروف

source: Paid
ar: مدفوع

source: Pending Payment
ar: في انتظار الدفع

source: All
ar: الكل

source: Pending
ar: في الانتظار

source: In Progress
ar: قيد التنفيذ

source: Delivered
ar: تم التوصيل

source: Canceled
ar: ملغي

source: Completed
ar: مكتمل

source: Cancelled
ar: ملغي

source: Forget Password
ar: نسيت كلمة المرور

# enterMobileOrEmail
source: Enter Mobile Number or Email
ar: أدخل رقم الهاتف أو البريد الإلكتروني

# enterMobileOrEmailHint
source: Enter Mobile Number or Email
ar: أدخل رقم الهاتف أو البريد الإلكتروني

source: Back To Login
ar: العودة لتسجيل الدخول

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# passwordMin8Chars
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# passwordResetSuccess
source: Password reset successfully. Please login.
ar: تم إعادة تعيين كلمة المرور بنجاح. يرجى تسجيل الدخول.

# passwordResetFailed
source: Failed to reset password. Please try again.
ar: فشل في إعادة تعيين كلمة المرور. يرجى المحاولة مرة أخرى.

source: Enter New Password
ar: أدخل كلمة المرور الجديدة

# enterNewPasswordHint
source: Enter new password
ar: أدخل كلمة المرور الجديدة

# confirmNewPassword
source: Confirm Password
ar: تأكيد كلمة المرور

source: Enter Confirmed Password
ar: أدخل كلمة المرور المؤكدة

source: Please enter 4-digit OTP
ar: يرجى إدخال رمز OTP المكون من 4 أرقام

# otpVerifiedSuccess
source: OTP verified successfully
ar: تم التحقق من رمز OTP بنجاح

# invalidOTP
source: Invalid OTP. Please try again.
ar: رمز OTP غير صالح. يرجى المحاولة مرة أخرى.

source: Verification
ar: التحقق

source: Enter Verification Code
ar: أدخل رمز التحقق

# ifDidntReceiveCode
source: If you didn't receive a code,
ar: إذا لم تستلم رمز التحقق،

source: Resend
ar: إعادة الإرسال

source: Send
ar: إرسال

source: Products
ar: المنتجات

source: Stores
ar: المتاجر

source: This Field Is Required
ar: هذا الحقل مطلوب

# qatar8DigitPhone
source: 8-digit Qatar phone number
ar: رقم هاتف قطري مكون من 8 أرقام

source: Or Continue As
ar: أو تابع كـ

source: Guest
ar: ضيف

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Logging in...
ar: جاري تسجيل الدخول...

source: Creating account...
ar: جاري إنشاء الحساب...

# fieldIsRequired
source: is required
ar: مطلوب

# emailAddressRequired
source: Email Address is required
ar: البريد الإلكتروني مطلوب

source: Your Cart
ar: سلتك

source: Delivery Address
ar: عنوان التوصيل

source: Clear Cart
ar: مسح السلة

# removeAllItemsFromCart
source: Remove all items from your cart?
ar: إزالة جميع العناصر من سلتك؟

# pleaseSelectAddress
source: Please select an address
ar: يرجى اختيار العنوان

source: Different supplier found
ar: تم العثور على مورد مختلف

# allProductsSameSupplier
source: All order products must be from the same supplier
ar: يجب أن تكون جميع منتجات الطلب من نفس المورد

source: Order created successfully!
ar: تم إنشاء الطلب بنجاح!

source: Failed to create order
ar: فشل في إنشاء الطلب

source: Cart cleared successfully
ar: تم مسح السلة بنجاح

source: Failed to clear cart
ar: فشل في مسح السلة

source: Payment Method
ar: طريقة الدفع

source: eWallet or Cash on Delivery
ar: المحفظة الإلكترونية أو الدفع عند الاستلام

# pleaseSelectPaymentMethod
source: Please select a payment method
ar: يرجى اختيار طريقة الدفع

source: Use eWallet Balance First
ar: استخدم رصيد المحفظة الإلكترونية أولاً

# availableBalance
source: Available Balance: QAR 840.00
ar: الرصيد المتاح: 840.00 ريال قطري

# ewalletWillCoverFullAmount
source: Your eWallet will cover the full amount (QAR 500.00)
ar: ستغطي المحفظة الإلكترونية المبلغ الكامل (500.00 ريال قطري)

source: Use Card
ar: استخدم البطاقة

# pleaseHaveAmountReady
source: Please have QAR 500.00 ready when your order arrives.
ar: يرجى تجهيز 500.00 ريال قطري عند وصول طلبك.

source: No Default Address
ar: لا يوجد عنوان افتراضي

source: Your Coupons
ar: كوبوناتك

# bundlePurchaseHistory
source: Bundle purchase history and details
ar: سجل وتفاصيل شراء الباقة

source: No bundles found
ar: لم يتم العثور على حزم

source: Coupon Bundle
ar: باقة الكوبونات

source: Auto-Renewal
ar: تجديد تلقائي

source: Change Address
ar: تغيير العنوان

source: Weekly Delivery Frequency
ar: تردد التوصيل الأسبوعي

source: Bottles Per Delivery
ar: زجاجات لكل توصيل

# preferredRefillTimesPerWeek
source: Preferred Refill Times /Week
ar: أوقات التعبئة المفضلة /الأسبوع

# usedAsGuideNotMandatory
source: Used As A Guide, Not Mandatory
ar: يستخدم كدليل وليس إلزامياً

source: Days
ar: الأيام

source: Preferred Time Slot
ar: الوقت المفضل

source: Schedule Status
ar: حالة الجدولة

source: Update Schedule
ar: تحديث الجدولة

source: Save Schedule
ar: حفظ الجدولة

source: Cancel Schedule
ar: إلغاء الجدولة

source: Purchased On
ar: تم الشراء في

source: Total Order Value
ar: إجمالي قيمة الطلب

# autoRenewalDescription
source: Automatically purchase new coupons when this bundle runs out
ar: شراء كوبونات جديدة تلقائياً عند نفاد هذه الباقة

source: No Delivery Address Yet
ar: لا يوجد عنوان توصيل بعد

source: View Last Consumption
ar: عرض آخر استهلاك

# maxPreferredDaysMessage
source: You can select up to {max} preferred days only.
ar: يمكنك اختيار {max} أيام مفضلة فقط.

source: Preferred Times For Refilling
ar: الأوقات المفضلة للتعبئة

source: Before Noon
ar: قبل الظهر

source: Coupon Details
ar: تفاصيل الكوبون

# noConsumptionHistory
source: No consumption history yet
ar: لا يوجد سجل استهلاك بعد

# noMarkedUsedCoupons
source: This bundle has no marked-used coupons.
ar: هذه الباقة لا تحتوي على كوبونات تم تحديد استخدامها.

source: Marked On
ar: تم التحديد في

source: Marked By
ar: تم التحديد بواسطة

source: Dispute Reason
ar: سبب النزاع

source: Never Received Water
ar: لم يتم استلام المياه

source: Show Delivery Photos
ar: عرض صور التوصيل

source: Dispute Resolved
ar: تم حل النزاع

source: Coupon Marked Used
ar: تم تحديد استخدام الكوبون

# pleaseRateSeller
source: Please rate the seller
ar: يرجى تقييم البائع

# thankYouReview
source: Thank you for your review!
ar: شكراً على تقييمك!

# writeReviewOptional
source: Write your review here (optional)
ar: اكتب تقييمك هنا (اختياري)

source: Upload Photo
ar: رفع صورة

source: Take Photo
ar: التقط صورة

# maxPhotosAllowed
source: Maximum 5 photos allowed
ar: الحد الأقصى 5 صور

# describeIssue
source: Please describe the issue
ar: يرجى وصف المشكلة

# writeDisputeReasons
source: Write your dispute here, explaining all your reasons
ar: اكتب نزاعك هنا، موضحاً جميع أسبابك

# disputeSubmitted
source: Dispute submitted successfully
ar: تم تقديم النزاع بنجاح

# failedSubmitDispute
source: Failed to submit dispute
ar: فشل في تقديم النزاع

# failedPickImages
source: Failed to pick images
ar: فشل في اختيار الصور

# failedCapturePhoto
source: Failed to capture photo
ar: فشل في التقاط الصورة

source: History
ar: السجل

source: Disputed
ar: متنازع عليه

source: Assigned Orders
ar: الطلبات المسندة

source: No address provided
ar: لم يتم توفير عنوان

# locationPermissionsDenied
source: Location permissions are denied
ar: تم رفض إذن الموقع

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied
ar: تم رفض إذن الموقع بشكل دائم

source: Failed to get location
ar: فشل في الحصول على الموقع

source: Please enable location services
ar: يرجى تمكين خدمات الموقع

source: Delivery confirmed successfully
ar: تم تأكيد التوصيل بنجاح

source: Failed to submit POD
ar: فشل في تقديم إيصال الاستلام

source: Delivery Confirmation
ar: تأكيد التوصيل

source: Confirm Delivery
ar: تأكيد التوصيل

source: Write comment here
ar: اكتب تعليق هنا

# writeCommentHereIfApplicable
source: Write a comment here if applicable
ar: اكتب تعليق هنا إذا كان ينطبق

# confirmDeliveryAlert
source: Confirm delivery
ar: تأكيد التوصيل

source: GPS required to confirm order.
ar: مطلوب GPS لتأكيد الطلب.

source: Open Camera
ar: فتح الكاميرا

source: Driver
ar: سائق

source: No favourite products
ar: لا توجد منتجات مفضلة

source: No favourite stores
ar: لا توجد متاجر مفضلة

source: Unknown Supplier
ar: مورد غير معروف

source: Product
ar: منتج

# companyHandPumpDescription
source: Company hand pump dispenser - pure natural...
ar: مضخة يد للشركة - مياه نقية طبيعية...

source: One Time Purchase
ar: شراء لمرة واحدة

source: Weekly Sent Bundles
ar: باقات أسبوعية مرسلة

# errorPrefix
source: Error:
ar: خطأ:

source: Reviews
ar: المراجعات

source: Popular Categories
ar: الفئات الشائعة

source: View All
ar: عرض الكل

source: Remove from cart
ar: إزالة من السلة

# removeFromCartConfirmation
source: Are you sure you want to remove this item from cart? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد إزالة هذا العنصر من السلة؟ لا يمكن التراجع عن هذا الإجراء.

# productWithId
source: Product
ar: منتج

# arabicProductWithId
source: Product
ar: منتج

source: No notifications
ar: لا توجد إشعارات

# neww
source: New
ar: جديد

source: Promos
ar: العروض

source: One time
ar: مرة واحدة

source: Disputes
ar: النزاعات

source: Select All
ar: تحديد الكل

source: Mark As Read
ar: تحديد كمقروء

source: Clear Selection
ar: مسح التحديد

# yesterdayAtTime
source: Yesterday at 10:44 AM
ar: أمس الساعة 10:44 ص

source: Order Detail
ar: تفاصيل الطلب

# orderWithId
source: Order
ar: طلب

source: Delivery started successfully
ar: تم بدء التوصيل بنجاح

# failedStartDeliveryWithReason
source: Failed to start delivery:
ar: فشل في بدء التوصيل:

source: Order cancelled successfully
ar: تم إلغاء الطلب بنجاح

# orderInProgress
source: In Progress
ar: قيد التنفيذ

# orderOneTime
source: One Time
ar: مرة واحدة

# orderCouponBased
source: Coupon Based
ar: قائم على الكوبون

# orderUnpaid
source: Unpaid
ar: غير مدفوع

# toDateCannotBeBeforeFrom
source: To date cannot be before From date
ar: لا يمكن أن يكون التاريخ "إلى" قبل التاريخ "من"

source: Enter UserName
ar: أدخل اسم المستخدم

source: Enter Phone Number
ar: أدخل رقم الهاتف

source: Enter Alternative phone number
ar: أدخل رقم الهاتف البديل

# cancelOrderConfirmation
source: Are you sure you want to cancel this order?
ar: هل أنت متأكد من أنك تريد إلغاء هذا الطلب؟

# paymentRefundMessage
source: Your payment will be refunded to your wallet.
ar: سيتم استرداد الدفع إلى محفظتك.

# startDeliveryConfirmation
source: Are you ready to start delivery for Order #
ar: هل أنت مستعد لبدء التوصيل للطلب #

source: Start
ar: بدء

source: Failed to start delivery:
ar: فشل في بدء التوصيل:

source: Failed to cancel order:
ar: فشل في إلغاء الطلب:

source: Order Summary
ar: ملخص الطلب

source: View Dispute Status
ar: عرض حالة النزاع

source: View Proof of Delivery
ar: عرض إثبات التوصيل

source: Delivery Summary
ar: ملخص التوصيل

source: Estimated Delivery
ar: التوصيل المتوقع خلال 24-48 ساعة

# within24Hours
source: Within 24-48 hours
ar: خلال 24-48 ساعة

source: Items Subtotal
ar: مجموع الأصناف

source: Subtotal
ar: المجموع الفرعي

source: Delivery Fee
ar: رسوم التوصيل

source: Tax
ar: الضريبة

source: Total
ar: الإجمالي

source: No items found
ar: لا توجد عناصر

source: Item Description
ar: وصف العنصر

source: Verified
ar: تم التحقق

source: Not Verified
ar: لم يتم التحقق

source: Show Less
ar: عرض أقل

source: Info
ar: المزيد من المعلومات

source: Failed to load suppliers
ar: فشل في تحميل الموردين

source: Water Suppliers
ar: موردون المياه

source: Vendor added to favorites
ar: تم إضافة المورد إلى المفضلة

source: Vendor removed from favorites
ar: تم إزالة المورد من المفضلة

source: Failed to update favorites
ar: فشل في تحديث المفضلة

source: Proceed to Checkout
ar: الشروع في الخروج

source: Delivery Experience
ar: تجربة التوصيل

source: Seller Experience
ar: تجربة البائع

source: Order Experience
ar: تجربة الطلب

source: Overall
ar: إجمالي

# languageChanged
source: Language changed successfully
ar: تم تغيير اللغة بنجاح

source: Language changed to English
ar: تم تغيير اللغة إلى الإنجليزية

source: Language changed to Arabic
ar: تم التغيير للغه العربيه

source: Notification Preferences
ar: تفضيلات الإشعارات

source: Edit Profile
ar: تعديل الملف الشخصي

source: Transfer Funds
ar: تحويل الأموال

# sendMoneyToAnotherUser
source: Send Money To Another User's Wallet
ar: إرسال المال إلى محفظة مستخدم آخر

source: Amount (QAR)
ar: المبلغ (ريال قطري)

source: Recipient
ar: المستلم

source: User Name or Mobile Number
ar: اسم المستخدم أو رقم الهاتف المحمول

source: Description
ar: الوصف

source: Wallet Transfer
ar: تحويل المحفظة

source: Available Balance: QAR 1,000
ar: الرصيد المتاح: 1,000 ريال قطري

source: Payment QR
ar: QR الدفع

# scanQRPayment
source: Scan QR
ar: مسح QR

source: Top-up
ar: شحن

source: Transfer
ar: تحويل

source: Scanned
ar: تم المسح

source: Low Coupon Alerts
ar: تنبيهات انخفاض الكوبونات

source: Wallet Balance Alerts
ar: تنبيهات رصيد المحفظة

# couponLowDesc
source: Get notified when your coupon balance is running low
ar: احصل على إشعار عند انخفاض رصيد الكوبونات

# walletLowDesc
source: Get alerts when your wallet balance is low
ar: احصل على تنبيهات عند انخفاض رصيد المحفظة

# couponCurrency
source: Coupons
ar: كوبونات

source: QAR
ar: ريال قطري

source: Add New Address
ar: إضافة عنوان جديد

source: Use Current Location
ar: استخدم الموقع الحالي

source: Open Google Map
ar: فتح خرائط جوجل

# deleteAddressTitle
source: Delete address
ar: حذف العنوان

# deleteAddressConfirm
source: Are you sure you want to delete this address?
ar: هل أنت متأكد من حذف هذا العنوان؟

source: No addresses found
ar: لم يتم العثور على عناوين

source: Order Updates
ar: تحديثات الطلبات

source: Refill Updates
ar: تحديثات إعادة الملء

source: Promotions & Offers
ar: العروض والترويجات

# orderUpdatesDesc
source: Receive notifications about your order status
ar: استلم إشعارات حول حالة طلبك

# refillUpdatesDesc
source: Get notified when your bottles have been refilled
ar: احصل على إشعارات عند إعادة تعبئة زجاجاتك

# promotionsOffersDesc
source: Receive notifications about promotions and special offers
ar: استلم إشعارات حول العروض والترويجات الخاصة

# searchWaterProducts
source: Search for water products...
ar: البحث عن منتجات المياه...

# writeCommentApplicable
source: Write a comment here if applicable
ar: اكتب تعليقًا هنا إذا كان ذلك مناسبًا

source: View All Coupons
ar: عرض جميع الكوبونات

source: Featured Suppliers
ar: الموردون المميزون

source: No featured suppliers found
ar: لم يتم العثور على موردين مميزين

source: No suppliers found
ar: لم يتم العثور على موردين

source: No categories found
ar: لم يتم العثور على فئات

# productsStillLoading
source: Products are still loading, please try again.
ar: المنتجات لا تزال قيد التحميل، يرجى المحاولة مرة أخرى.

source: Failed to load products
ar: فشل في تحميل المنتجات

# noProductsMatchSearch
source: No products match your search
ar: لا توجد منتجات تطابق بحثك

source: No products found
ar: لم يتم العثور على منتجات

source: Category
ar: فئة

# failedSavePreferences
source: Failed to save preferences
ar: فشل في حفظ التفضيلات

source: Invalid order id
ar: معرف الطلب غير صالح

source: Permission Required
ar: الإذن مطلوب

# cameraPermissionDenied
source: Camera permission is permanently denied. Please go to App Settings → Permissions → Enable Camera.
ar: إذن الكاميرا مرفوض بشكل دائم. يرجى الذهاب إلى إعدادات التطبيق → الأذونات → تفعيل الكاميرا.

source: Open Settings
ar: فتح الإعدادات

# unexpectedError
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

source: Authentication required
ar: المصادقة مطلوبة

# errorMessage
source: Error
ar: خطأ

source: Success
ar: نجح

source: OK
ar: موافق

# toDateBeforeFrom
source: To date cannot be before From date
ar: لا يمكن أن يكون التاريخ "إلى" قبل التاريخ "من"

source: Early Morning
ar: صباحاً باكراً

source: Morning
ar: صباح

source: Afternoon
ar: بعد الظهر

source: Evening
ar: مساء

source: Night
ar: ليل

source: Unlocked
ar: تم فتحه

source: Your Achievements
ar: إنجازاتك

# milestonesReached
source: Milestones you've reached
ar: الأهداف التي حققتها

source: App Explorer
ar: مستكشف التطبيق

# appExplorerDesc
source: Explored the MOYAH water delivery app features
ar: استكشفت ميزات تطبيق MOYAH لتوصيل المياه

source: Water Supporter
ar: داعم المياه

# waterSupporterDesc
source: Joined the community supporting clean water access
ar: انضممت إلى المجتمع الداعم للوصول إلى المياه النظيفة

source: First Steps
ar: الخطوات الأولى

# firstStepsDesc
source: Started your journey to help donate clean water
ar: بدأت رحلتك للمساعدة في التبرع بالمياه النظيفة

source: Loading...
ar: جاري التحميل...

source: No Data
ar: لا توجد بيانات

source: Close
ar: إغلاق

source: Done
ar: تم

source: Save
ar: حفظ

source: Edit
ar: تعديل

# removeItem
source: Delete
ar: حذف

source: Yes
ar: نعم

source: No
ar: لا

source: Clear All
ar: مسح الكل

source: Unknown Product
ar: منتج غير معروف

# continuee
source: Continue
ar: متابعة

source: Back
ar: رجوع

source: Next
ar: التالي

source: Finish
ar: إنهاء

source: Edit Personal File
ar: تعديل الملف الشخصي

source: Bottles
ar: زجاجات

source: You can select up to
ar: يمكنك الاختيار حتى

source: preferred days only.
ar: أيام مفضلة فقط

source: Product Details
ar: تفاصيل المنتج

source: Read
ar: تمت قرأتهم

source: Enter Name
ar: أدخل الاسم

source: Gender
ar: الجنس

source: Saving...
ar: جارٍ الحفظ...

source: Phone Number
ar: رقم التليفون

source: Security
ar: الأمن

source: Transaction History
ar: سجل المعاملات

source: From
ar: من

source: To
ar: إلي

source: No Transactions Found
ar: لم يتم العثور على معاملات

source: Resolution
ar: الحل

source: Returned
ar: المُعاد

source: Dispute
ar: النزاع

source: Vendor
ar: البائع

# unknownDate
source: UNkOWN DATE
ar: تاريخ غير معروف

source: Re-Order
ar: إعادة الطلب

source: View Details
ar: عرض التفاصيل

source: Customer Reviews
ar: آراء العملاء

source: Rating Summary
ar: ملخص التقييم

source: Overall
ar: التقييم العام

source: No Addresses Found
ar: لم يتم العثور على عناوين

source: Please Wait...
ar: يرجى الانتظار...

source: Bottles Donated
ar: زجاجات تم التبرع بها

# makingDifferenceOneBottle
source: Making A Difference One Bottle At A Time
ar: إحداث فرق... زجاجة بعد زجاجة

source: Progress To Next Milestone
ar: التقدم نحو الهدف التالي

source: Next Refill
ar: إعادة التعبئة القادمة

source: Next Refill Appointment
ar: موعد إعادة التعبئة القادمة

source: Edit Next Refill
ar: تعديل موعد إعادة التعبئة

source: Request New Date
ar: طلب موعد جديد

source: Not Selected
ar: غير محدد

# nocCouponBalanceFound
source: No Coupon Balance Found
ar: لا يوجد رصيد كوبونات

source: Last Delivered
ar: آخر توصيل

source: Remaining
ar: المتبقي

source: Used
ar: المستخدم

source: Coupon Balance
ar: رصيد الكوبونات
